import numpy as np

# 三角函数相关方法
# 定义几个常用角度，x 中定义的是int数字，是角度
# 通过 成 np.pi / 180 转化为弧度
x = [0, 30, 45, 60, 90]
x = np.array(x) * np.pi/180  # [0.         0.52359878 0.78539816 1.04719755 1.57079633]

# 正弦值
sin = np.sin(x)
print(sin)  # [0.         0.5        0.70710678 0.8660254  1.        ]

# 余弦值
cos = np.cos(x)
print(cos)  # [1.00000000e+00 8.66025404e-01 7.07106781e-01 5.00000000e-01  6.12323400e-17]

# 正切值
tan = np.tan(x)
print(tan)  # [0.00000000e+00 5.77350269e-01 1.00000000e+00 1.73205081e+00  1.63312394e+16]

# 正弦反三角函数
inv = np.arcsin(sin)  # 得到弧度
print(inv)  # [0.         0.52359878 0.78539816 1.04719755 1.57079633]
print(np.degrees(inv))  # 转为角度  [ 0. 30. 45. 60. 90.]

# 其他反三角函数类似
